Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/db-omegat.tmx
Source language: en_us
Languages: pt_br

source: Name
pt_br: Nome

source: There is no connection to this database
pt_br: Não há conexão para este banco de dados

source: Database connection error, a connection should have been established by now
pt_br: Erro de conexão no banco de dados, uma conexão deveria ter ocorrido agora

source: The data source name {0} is already in use or a part of the name is in use.
pt_br: O nome da fonte de dados {0} já esta em uso ou parte de seu nome está em uso.

source: Please provide another name.
pt_br: Por favor informe outro nome.

source: Add Data Source Reference
pt_br: Adicionar Referência a Fonte de Dados

source: Add a Data Source Reference to a Project
pt_br: Adicionar uma Referência da Fonte de Dados para o Projeto.

source: Add a data source to deploy with this project.
pt_br: Adicionar uma fonte de dados para implantar com este projeto.

source: If the data source you need is not shown here, make it available by adding it to the Server Navigator.
pt_br: Se a fonte de dados que você precisa não está listada aqui, torne-á disponível adicionando-a no Navegador do Servidor.

source: Available Data Sources:
pt_br: Fontes de Dados Disponíveis:

source: Select a data source to add to the project
pt_br: Selecione uma fonte de dados para adicionar ao projeto

source: driver name:
pt_br: nome do driver:

source: Server Name:
pt_br: Nome do Servidor:

source: TDisplay Name cannot be blank.
pt_br: Nome de Exibição não pode ser branco.

source: New Driver Name
pt_br: Novo Nome do Driver

source: does not have an associated JDBC driver.
pt_br: não possui um driver JDBC associado.

source: Click Edit to add the JDBC driver jar files.
pt_br: Clique Editar para adicionar os arquivos jar de driver JDBC.

source: Information
pt_br: Informação

source: Modify
pt_br: Modificar

source: Table View
pt_br: Visualizar Tabela

source: Data Source Name cannot be empty.
pt_br: Nome da Fonte de Dado não pode ser branco.

source: Select Schemas to display in the Server Navigator:
pt_br: Selecione os Esquemas para exibição no Navegador do Servidor:

source: Connection
pt_br: Conexão

source: Schemas
pt_br: Esquemas

source: Modify Data Source
pt_br: Modificar Fonte de Dado

source: Get Schemas
pt_br: Busque Esquemas

source: Retrieve List of Schemas for Data Source
pt_br: Recupere Lista de Esquemas para Fonte de Dado

source: Select all Schemas
pt_br: Selecionar Todos Esquemas

source: Clear all Schemas.
pt_br: Selecionar Todos Esquemas.

source: At least one schema must be selected.
pt_br: Pelo menos um esquema deve ser selecionado.

source: Server Type Display Name {0} is not unique.
pt_br: Nome de Exibição do Tipo de Servidor {0} não é único.

source: Please provide a unique Name
pt_br: Por favor informe um Nome único

source: Server Type Display Name cannot be empty.
pt_br: Nome de Exibição do Tipo de Servidor não pode ser branco.

source: Driver Class Name cannot be empty.
pt_br: Nome da Classe do Driver não pode ser branco.

source: Suggest
pt_br: Sugestão

source: Search The Jar(s) for Possible JDBC Driver Classes
pt_br: Localize O(s) Jar(s) para Possíveis Classes de Driver JDBC

source: Could not delete file {0}: it may be in use.
pt_br: Não pode excluir arquivo {0}: ele pode estar em uso.

source: If you have any existing data source connections using classes in this jar, restart the IDE or otherwise break the connection.
pt_br: Se possui qualquer conexão de fonte de dados existente utilizando classes neste jar, reinicie o IDE ou então encerre a conexão.

source: <no data sources available>
pt_br: <nenhuma fonte de dados disponível>

source: Close
pt_br: Fechar

source: exists.
pt_br: existe.

source: Overwrite?
pt_br: Sobreescrever?

source: Remove selected JDBC driver jar(s)?
pt_br: Remover arquivo(s) jar de driver JDBC selecionado?

source: Driver Class name not specified.
pt_br: Nome da Classe do Driver não especificado.

source: Database URL cannot be empty
pt_br: URL do Banco de Dados não pode ser vazia

source: Locate JDBC Jar File(s)
pt_br: Localize Arquivo(s) Jar JDBC

source: No Datasource(s) selected to export.
pt_br: Nenhuma Fonte(s) de Dados selecionada para exportar.

source: No Datasource(s) selected to import.
pt_br: Nenhuma Fonte(s) de Dados selecionada para importar.

source: Jar or Zip Files (*.jar, *.zip)
pt_br: Arquivos Jar ou Zip (*.jar, *.zip)

source: Xml Files (*.xml)
pt_br: Arquivos Xml (*.xml)

source: <Add Server Type>
pt_br: <Adicionar Tipo de Servidor>

source: Query {0}
pt_br: Consulta {0}

source: Query:
pt_br: Consulta:

source: Query or SQL Statement to Run
pt_br: Consulta ou Comando SQL para Execução

source: Running Query ...
pt_br: Executando Consulta...

source: Data Source: {0}
pt_br: Fonte de Dado: {0}

source: Data Source: {0}, Last Run {1}
pt_br: Fonte de Dado: {0}, Última Execução {1}

source: Rows:
pt_br: Linhas:

source: Maximum number of rows to retrieve.
pt_br: Número máximo de linhas para recuperar.

source: Run Query
pt_br: Executar Consulta

source: Run the Query
pt_br: Rodar a Consulta

source: Previous Query in History
pt_br: Consulta Anterior no Histórico

source: Next Query in History
pt_br: Próxima Consulta no Histórico

source: Show Command History
pt_br: Exibir Histórico de Comandos

source: Configure Run Options
pt_br: Configurar Opções de Execução

source: Import File containing SQL commands
pt_br: Importar Arquivo contendo comandos SQL

source: {0} Row(s).
pt_br: {0} Linha(s).

source: {0} Rows(s).
pt_br: {0} Linha(s).

source: (Results truncated to {1} rows.)
pt_br: (Resultados truncados para {1} linhas.)

source: {0} row(s) affected.
pt_br: {0} linha(s) afetada(s).

source: Error
pt_br: Erro

source: Results from the Query
pt_br: Resultados da Consulta

source: The data source {0} was not found.
pt_br: A fonte de dado {0} não foi localizda.

source: Try opening a new query window or recreate the data source {0}
pt_br: Tente abrir uma nova janela de consulta or recriar a fonte de dados {0}

source: Run any Query or other SQL statement on the data source.
pt_br: Executar qualquer Consulta ou outro comando SQL na fonte de dados.

source: SQL Command terminator:
pt_br: Comando SQL finalizador:

source: ";" (semicolon) at end of line
pt_br: ";" (vírgula) no fim da linha

source: Semicolon at end of a line terminates an SQL command
pt_br: Vírgula no fim da linha finaliza um comando SQL

source: "go" on its own line
pt_br: "vá" para sua própria linha

source: The word go on its own line terminates an SQL command
pt_br: A palavra vai em para sua própria linha finaliza um comando SQL

source: none (execute as one batch of commands)
pt_br: nenhum (executa como um batch de comandos)

source: The text is a single SQL command
pt_br: O texto é um comando SQL único

source: Stop Execution on Error
pt_br: Para Execução com Erro

source: Stop executing multiple SQL commands when an exception happens
pt_br: Para a execução de múltiplos comandos SQL quando uma exceção ocorre

source: Echo Query
pt_br: Eco em Consulta

source: Echo Query in Results pane
pt_br: Ecoar Consulta em painél de Resultados

source: Run Query Options
pt_br: Executar Opções de Consulta

source: Excecution stopped because error encountered.
pt_br: Execução parou pois foram encontrados erros.

source: Import File ...
pt_br: Importar Arquivo...

source: Run Options ...
pt_br: Executar Opções ...

source: History
pt_br: Histórico

source: Command History:
pt_br: Histórico de Comando:

source: Command History is empty.
pt_br: Histórico de Comando esta vazio

source: Run
pt_br: Executar

source: Run this Query.
pt_br: Executar esta Consulta

source: Edit
pt_br: Editar

source: Copy this Query to the Query text area for editing.
pt_br: Copiar esta Consulta para edição em área de texto da Consulta.

source: Remove this Query from the history.
pt_br: Remover esta Consulta do histórico.

source: Alias Name:
pt_br: Nome do Álias:

source: Data Source Alias's name.
pt_br: Nome do Álias da Fonte de Dados

source: Data Source Alias Definition
pt_br: Definição do Álias da Fonte de Dados

source: Define a Data Source Alias's Referenced Data Source
pt_br: Definir um Nome de Álias a Fonte de Dados Referenciada

source: References:
pt_br: Referências:

source: Pick the data source that this alias references
pt_br: Selecione a fonte de dados que este aliás referencia

source: {0} Connection Status
pt_br: Status da Conexão {0}

source: Connection Status:
pt_br: Status da Conexão:

source: Succeeded
pt_br: Sucesso

source: Failed
pt_br: Falhou

source: Validation Table Status:
pt_br: Validação do Status da Tabela::

source: Rows in table {0}: {1}
pt_br: Linhas na tabela {0}: {1}

source: No validation table provided.
pt_br: Nenhuma tabela de validação fornecida.

source: Probable good choice for validation table.
pt_br: Provável escolha boa para tabela de validação.

source: Possbile poor choice for validation table: too many rows in table.
pt_br: Possível escolha fraca para tabela de validação: muitas linhas na tabela.

source: The ideal validation table exists only for connection validation purposes.
pt_br: A tabela de validação ideal existe somente para propósitos de validação de conexão.

source: Do not use an existing table that has a large number of rows or a table that will be frequently accessed.
pt_br: Não utilize uma tabela existente que possua um grande número de linhas ou uma tabela que será frequentemente acessada.

source: Select Validation Table
pt_br: Selecione uma Tabela de Validação

source: Select
pt_br: Selecione

source: Select the table for connection validation.
pt_br: Selecione a tabela para validação da conexão.

source: List of Tables that may be used for conneciton Validation
pt_br: Lista de Tabelas que podem ser utilizadas para Validação de conexão

source: How to pick a good Table
pt_br: Como selecionar uma boa Tabela

source: How to pick a good validation table
pt_br: Como selecionar uma boa Tabela de Validação

source: No tables were found.
pt_br: Nenhuma tabela foi encontrada.

source: Check your connection information.
pt_br: Verifique suas informações de conexão.

source: <name of component>
pt_br: <nome do componente>

source: My Wizard
pt_br: Meu Assistente

source: {0} of {1}
pt_br: {0} de {1}

source: Panel Name
pt_br: Nome do Painél

source: Run Action
pt_br: Rodar Ação

source: Select Table(s) to Add
pt_br: Selecionar Tabela(s) para Adicionar

source: Add Table...
pt_br: Adicionar Tabela...

source: Table List
pt_br: Lista de Tabelas

source: The list of database table/view names.
pt_br: A lista dos nomes das tabelas/views do banco de dados.

source: Add Query Criteria
pt_br: Adicionar Critério a Consulta

source: Add Query Criteria...
pt_br: Adicionar Critério a Consulta...

source: The Add Query Criteria dialog box enables you to refine your SQL query by creating or adding query criteria to the WHERE clause of the SQL statement.
pt_br: A caixa de diálogo Adicionar Critério a Consulta permite você refinar a sua consulta SQL criando ou adicionando um critério de consulta para a cláusula WHERE do comando SQL.

source: Add 'AND' Query Criteria
pt_br: Adicione o Critério de Consulta 'AND'

source: Add 'OR' Query Criteria
pt_br: Adicione o Critério de Consulta 'OR'

source: Sort...
pt_br: Ordenar...

source: Edit RowSet Query
pt_br: Editar Consulta RowSet

source: Parse Query
pt_br: Validar Consulta

source: Remove from Query
pt_br: Remover da Consulta

source: Invalid alias name.
pt_br: Nome álias inválido.

source: Please enter a valid alias.
pt_br: Por faor informe um álias válido.

source: Table name
pt_br: Nome da tabela

source: Alias Name
pt_br: Nome do Álias

source: Alias name for the table
pt_br: Nome do álias para a tabela

source: Table 1
pt_br: Tabela 1

source: First table for join
pt_br: Primeira tabela para join

source: Table 2
pt_br: Tabela 2

source: Second table for join
pt_br: Segunda tabela para join

source: Column 1
pt_br: Coluna 1

source: First column for join
pt_br: Primeira coluna para join

source: Column 2
pt_br: Coluna 2

source: Second column for join
pt_br: Segunda coluna para join

source: Type for join
pt_br: Tipo para o join

source: Query Processing Error:
pt_br: Erro de Processamento da Consulta:

source: The JDBC Driver does not provide the capabilities required for this feature.
pt_br: O Driver JDBC não fornece as capacidades necessárias para esta funcionalidade.

source: Error Accessing Parameter Metadata:
pt_br: Erro ao Acessar Metadado do Parâmetro:

source: Error Connecting to Database:
pt_br: Erro Conectando ao Banco de Dados:

source: Parse Error:
pt_br: Erro de Validação:

source: The Query Editor attempts to support a subset of SQL that is common among database platforms.
pt_br: O Editor de Consulta provê suporte para um sub-conjunto do SQL que é comum entre as plataformas de banco de dados.

source: You have entered a query that cannot be displayed graphically but may still execute properly.
pt_br: Foi informado uma consulta que não pode ser exibida graficamente mas que talvez possa ser executada corretamente.

source: Click Continue to run this query.
pt_br: Clique Continuar para executar esta consulta.

source: Click Cancel to restore the query to the previous valid state.
pt_br: Clique Cancelar para retornar a consulta no estado válido anterior.

source: Click Value to enter a static value for the criterion.
pt_br: Clique Valor para informar um valor estático para o critério.

source: Click Parameter to create a positional parameter that will be supplied by your program.
pt_br: Clique Parâmetro para criar um parâmetro posicional que será alimentado pelo seu programa.

source: Column Name
pt_br: Nome da Coluna

source: Displays the name of the column to which the query criteria apply.
pt_br: Apresenta o nome da coluna que o critério da consulta se aplica.

source: Comparison
pt_br: Comparação

source: The dropdown to set the comparison operator to use in the criteria such as = equal, <less than, <= less than or equal to, >greater than, >= greater than or equal to, <>not equal, IN and LIKE.
pt_br: Para comparação são utilizados os operadores em critérios como = igual, < menor que, <= menor ou igual que, > maior que, >= maior ou igual que, <> diferente, IN e LIKE

source: Value
pt_br: Valor

source: The field to specify the static value to use in the comparison, such as 8 for a numeric field or 'Smith' for a text field.
pt_br: O campo para especificar o valor estático que será utilizado na comparação, como 8 para um campo numérico ou 'Smith' para um campo texto.

source: The radio button to specify whether the user wants to input the absolute value for the parameter.
pt_br: O botão de rádio para especificar se o usuário deseja informar o valor absoluto para o parâmetro.

source: Parameter
pt_br: Parâmetro

source: The field to specify a parameter from your program.
pt_br: O campo para especificar o parâmetro a partir do seu programa.

source: The radio button to specify whether the user wants to input the value for the parameter programatically.
pt_br: O botão de rádio para especificar se o usuário deseja informar o valor para o parâmetro programaticamente.

source: Unable to check parameter specifications because parameterized queries are not supported in this version.
pt_br: Incapaz de verifcar as especificações do parâmetro pois consultas parametrizadas não são suportadas nesta versão.

source: Continue?
pt_br: Continuar?

source: Parameter Notification
pt_br: Notificação de Parâmetro

source: Cut
pt_br: Recortar

source: Copy
pt_br: Copiar

source: Paste
pt_br: Colar

source: Change Type
pt_br: Mudar Tipo

source: Collapse Pane
pt_br: Expandir Painél

source: Add to Query
pt_br: Adicionar a Consulta

source: Sort Ascending
pt_br: Ordenar Crescente

source: Sort Descending
pt_br: Ordenar Decrescente

source: Ascending
pt_br: Crescente

source: Descending
pt_br: Decrescente

source: Remove Filter
pt_br: Remover Filtro

source: At least one query must be specified for a column before adding more, using AND/OR.
pt_br: Pelo menos uma consulta deve ser informada para a coluna antes de adicionar outra, utilizando AND/OR.

source: The query must contain at least one table.
pt_br: A consulta deve conter pelo menos uma tabela.

source: Add a table to the Query Editor.
pt_br: Adicione uma tabela para o Editor de Consulta.

source: Could not connect to the above database.
pt_br: Incapaz de conectar ao banco de dados acima.

source: Please make sure that there is a connection to the database.
pt_br: Por favor, certifique-se que exista uma conexão ao banco de dados.

source: Click Retry and Continue to try to connect to the
pt_br: Clique Repetir e Continue para tentar se conectar ao

source: database or click Cancel and Continue to continue without the connection.
pt_br: banco de dados ou clique Cancelar e Continuar para continuar sem a conexão.

source: If you click Cancel and Continue, tables may not be displayed.
pt_br: Se você clicar Cancelar e Continuar, as tabelas talvez não sejam exibidas.

source: Continue
pt_br: Continuar

source: Retry and Continue
pt_br: Repetir e Continuar

source: Cancel and Continue
pt_br: Cancelar e Continuar

source: Database Connection Error
pt_br: Erro de Conexão ao Banco de Dados

source: = Equals
pt_br: = Igual

source: <> Not Equals
pt_br: <> Diferente

source: < Less Than
pt_br: < Menor Que

source: <= Less Than Equals
pt_br: <= Menor ou Igual Que

source: > Greater Than
pt_br: > Maior Que

source: >= Greater Than Equals
pt_br: >= Maior ou Igual Que

source: Column Names
pt_br: Nomes das Colunas

source: Table Name Only
pt_br: Somente Nome de Tabela

source: Select All Columns
pt_br: Selecionar Todas Colunas

source: Properties
pt_br: Propriedades

source: Output
pt_br: Saída

source: Sort Type
pt_br: Tipo de Ordenação

source: Sort Order
pt_br: Ordem da Ordenação

source: Criteria
pt_br: Critério

source: Order
pt_br: Ordenação

source: Or...
pt_br: Ou...

source: Error encountered in the query value.
pt_br: Erro encontrado no valor da consulta.

source: Tables will not display correctly.
pt_br: Tabelas não serão exibidas corretamente.

source: Please check the table and column names.
pt_br: Por favor verifique os nomes de colunas e tabelas.

source: Results truncated; displaying the first {0} entries.
pt_br: Resultados truncados; exibindo as primeiras {0} ocorrências.

source: Error in the specified criteria.
pt_br: Erro ao especificar critério.

source: The requested change would result in an empty SELECT list, which is not allowed in SQL.
pt_br: A mudança requisitada pode resultar e uma lista SELECT vazia, o que não é permitido em SQL.

source: Example: '%value%'
pt_br: Exemplo: '%valor%'

source: Example: ( 'value1', 'value2', ... )
pt_br: Exemplo: ( 'valor1', 'valor2', ... )

source: Drag and drop failed.
pt_br: Drag and drop falhou.

source: Please drag a table from the current connection
pt_br: Por favor arraste a tabela da conexão corrente

source: Please drag a column from one table in the graph pane onto a column of another table in the graph pane.
pt_br: Por favor arraste a coluna a partir de uma tabela do painél gráfico para uma coluna de outra tabela no painél gráfico.

source: If you are trying to create a self join, please create another instance of the table by adding same table to the graph pane.
pt_br: Se você esta tentando criar um auto join, favor criar outra instância da tabela adicionando a mesma tabela no painél gráfico.

source: Specify Parameter Values
pt_br: Especifique os Valores dos Parâmetros

source: You have chosen to run a parameterized query that requires parameter values.
pt_br: Você escolheu executar uma consulta parametrizada que requer os valores dos parâmetros.

source: Please fill in the required values.
pt_br: Por favor preencha os valores obrigatórios.

source: Cannot establish connection to database.
pt_br: Não pode estabelecer uma conexão ao banco de dados.

source: Query Graph
pt_br: Gráfico da Consulta

source: Graphical representation of the query
pt_br: Representação gráfica da consulta

source: Query Table
pt_br: Consultar Tabela

source: Tabular representation of the query
pt_br: Representação tabular da consulta

source: Query Text
pt_br: Consultar Texto

source: Textual representation of the query
pt_br: Representação textual da consulta

source: SQL Indentation Engine
pt_br: Motor de Indentação SQL

source: Indentation Engine for SQL files
pt_br: Motor de Indentação para arquivos SQL

source: SQL Command {0}.sql
pt_br: Comando SQL {0}.sql

source: White Space
pt_br: Espaço em Branco

source: Line Comment
pt_br: Comentário de Linha

source: Single Line Comment
pt_br: Comentário de Linha Único

source: -- Comment
pt_br: -- Comentário

source: Block Comment
pt_br: Comentário de Bloco

source: /* Comment */
pt_br: /* Comentário */

source: String Literal
pt_br: Literal String

source: Identifier
pt_br: Identificador

source: MyTable
pt_br: MinhaTabela

source: Operator
pt_br: Operador

source: Integer Literal
pt_br: Literal Inteiro

source: Integer literal
pt_br: Literal inteiro

source: Floating Point Literal
pt_br: Literal Ponto Flutuante

source: Floating point literal
pt_br: Literal ponto flutuante

source: Period
pt_br: Período

source: SQL Keyword
pt_br: Palavra chave SQL

source: SQL Error
pt_br: Erro SQL

source: 'Incomplete String Literal
pt_br: 'Literal String Incompleto

source: Supports editing SQL files in the IDE
pt_br: Suporta edição de arquivos SQL no IDE

source: Allows SQL files to be edited with syntax highlighting and to be executed against a connection defined in the Database Explorer.
pt_br: Permite que arquivos SQL sejam editados com sintaxe marcada e que sejam executadas em uma conexão definida no Explorador de Banco de Dados

source: City Lights
pt_br: Cidade de Luzes

source: Default
pt_br: Padrão

source: Whitespace
pt_br: Espaço em branco

source: Integer
pt_br: Inteiro

source: Floating Point
pt_br: Ponto Flutuante

source: Keyword
pt_br: Palavra chave

source: C&onnection:
pt_br: C&onexão:

source: Database Conection
pt_br: Conexão do Banco de Dados

source: Run SQL
pt_br: Rodar SQL

source: Select Connection in Runtime
pt_br: Selecionar Conexão em Tempo de Execução

source: &Run SQL Selection
pt_br: &Rodar SQL Selecionado

source: &Run Selection
pt_br: &Rodar Seleção

source: &Run Statement
pt_br: &Rodar Sentença

source: No database connection is selected.
pt_br: Nenhuma conexão de banco de dados esta selecionada.

source: Please select one in the Connection combo box in the editor toolbar.
pt_br: Por favor selecione uma Conexão na caixa de seleção na barra de ferramentas do editor.

source: Subqueries in comparisons
pt_br: Subconsultas em comparações

source: Correlated subqueries
pt_br: Subconsultas correlacionadas

source: Not set
pt_br: Não configurado

source: command {0} is not supported by system
pt_br: comando {0} não é suportado pelo sistema

source: adaptor should implement DatabaseAdaptor interface
pt_br: adaptador deveria implementar a interface DatabaseAdaptor

source: unspecified adaptor class
pt_br: classe adaptadora não especificada

source: connection open
pt_br: conexão aberta

source: no connection specified
pt_br: nenhuma conexão especificada

source: unable to close connection
pt_br: incapaz de fechar conexão

source: unable to find or init class {0} for command {1} ({2})
pt_br: incapaz de localizar ou iniciar classe {0} para comando {1} ({2})

source: expected {0}, found: {1}
pt_br: esperado {0}, encontrado: {1}

source: unexpected key, found: {0}
pt_br: chave não esperada, encontrada: {0}

source: expected object, found: {0}
pt_br: objeto esperado, encontrado: {0}

source: unknown object name
pt_br: nome de objeto desconhecido

source: no format specified
pt_br: formato não especificado

source: unable to locate binded object {0}
pt_br: Incapaz de localizar objeto atachado {0}
